{
    "URL": "https://www.allrecipes.com/recipe/270860/garlic-naan/?internalSource=rr_feed_recipe_sb&referringId=15300%20referringContentType%3Drecipe\n",
    "host": "allrecipes.com",
    "ingredients": [
        "1/2 cup warm water",
        "1 teaspoon white sugar",
        "1 (.25 ounce) package active dry yeast",
        "For the Garlic Butter:",
        "1/4 cup butter",
        "2 cloves garlic, minced",
        "1/4 cup plain yogurt",
        "2 cups bread flour, or more as needed",
        "1 teaspoon kosher salt",
        "1/4 cup chopped cilantro (optional)"
    ],
    "instructions": [
        "Combine water, sugar, and yeast in a bowl. Let stand until yeast softens and forms a creamy foam, about 15 minutes.",
        "In the meantime, heat butter in a pan over medium heat until melted and sizzling. Quickly mix in garlic. Remove garlic butter from heat and set aside until ready to use.",
        "Add yogurt, bread flour, salt, and 1 tablespoon of the garlic butter to the yeast mixture. Stir with a wooden spoon until a shaggy dough forms. Knead by hand until dough pulls away from the sides of the bowl, adding more water or flour as needed. Turn dough out onto the counter and continue kneading into a smooth ball, 3 to 4 minutes.",
        "Place dough in a large bowl. Coat with a few more drizzles of garlic butter. Cover and let rise until doubled in volume, about 2 hours.",
        "Punch down dough and turn out onto the counter. Shape into a rough rectangle and cut into 6 pieces. Roll each piece into a ball and lightly dust with flour. Cover with plastic wrap and proof until slightly puffy, 15 to 20 minutes.",
        "Roll each piece into an oval about 1/8 inch thick. Sprinkle some cilantro on top and press lightly to adhere.",
        "Preheat a cast iron skillet until very, very hot, about 5 minutes. Cook each naan until large bubbles form, 1 to 2 minutes. Flip over, press gently, and cook until bubbles on the bottom are charred, 2 to 3 minutes more.",
        "Brush naan with more garlic butter before serving.",
        ""
    ],
    "ratings": 4.93,
    "reviews": "",
    "title": "Garlic Naan",
    "total_time": 190,
    "yields": "6 serving(s)"
}
